
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_service.service_main will be created
  + resource "google_cloud_run_v2_service" "service_main" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_INTERNAL_LOAD_BALANCER"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + name                    = "edup92vault-service-main"
      + observed_generation     = (known after apply)
      + project                 = "fluted-result-476220-j1"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "vaultwarden/server:latest"

              + env {
                  + name  = "DOMAIN"
                  + value = "https://vault.edup92mail.xyz"
                }
              + env {
                  + name  = "ROCKET_PORT"
                  + value = "80"
                }
              + env {
                  + name  = "ROCKET_ADDRESS"
                  + value = "0.0.0.0"
                }
              + env {
                  + name  = "SIGNUPS_ALLOWED"
                  + value = "false"
                }
              + env {
                  + name  = "INVITATIONS_ALLOWED"
                  + value = "false"
                }
              + env {
                  + name  = "WEBSOCKET_ENABLED"
                  + value = "true"
                }
              + env {
                  + name  = "WEB_VAULT_ENABLED"
                  + value = "true"
                }
              + env {
                  + name  = "ADMIN_TOKEN"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "TZ"
                  + value = "Europe/Madrid"
                }
              + env {
                  + name  = "SMTP_HOST"
                  + value = "smtp.gmail.com"
                }
              + env {
                  + name  = "SMTP_FROM"
                  + value = "edup92mail@gmail.com"
                }
              + env {
                  + name  = "SMTP_PORT"
                  + value = "587"
                }
              + env {
                  + name  = "SMTP_SECURITY"
                  + value = "starttls"
                }
              + env {
                  + name  = "SMTP_USERNAME"
                  + value = "edup92mail@gmail.com"
                }
              + env {
                  + name  = "SMTP_PASSWORD"
                  + value = (sensitive value)
                }
              + env {
                  + name  = "DATABASE_URL"
                  + value = (sensitive value)
                }

              + liveness_probe (known after apply)

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "0.25"
                      + "memory" = "256Mi"
                    }
                }

              + startup_probe (known after apply)

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 1
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = [
                      + "fluted-result-476220-j1:europe-southwest1:edup92vault-sql-main",
                    ]
                }
            }
        }

      + traffic (known after apply)
    }

  # google_compute_disk_resource_policy_attachment.disk_policy_attachment will be created
  + resource "google_compute_disk_resource_policy_attachment" "disk_policy_attachment" {
      + disk    = "edup92vault-disk-main"
      + id      = (known after apply)
      + name    = "edup92vault-snapshot-main"
      + project = "fluted-result-476220-j1"
      + zone    = "europe-southwest1-a"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
